PIT4/soap/v1/enhanced_reporting_pit4.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<!--
Document History:
======== Version 0.1 ====================================
i. Document Created 22/02/2023

-->
<wsdl:definitions name="EnhancedReportingRequirements" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/"
				  xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/"
				  targetNamespace="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/">

	<wsdl:types>
		<xs:schema>
			<xs:import namespace="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/" schemaLocation="enhanced_reporting/v1/enhanced_reporting-schema.xsd" />
		</xs:schema>
	</wsdl:types>
	
	<wsdl:message name="EnhancedReportingSubmissionRequest">
		<wsdl:part element="tns:EnhancedReportingSubmissionRequest" name="parameters"/>
	</wsdl:message>
	<wsdl:message name="EnhancedReportingSubmissionResponse">
		<wsdl:part element="tns:EnhancedReportingSubmissionResponse" name="parameters"/>
	</wsdl:message>
	<wsdl:message name="CheckErrSubmissionRequest">
		<wsdl:part element="tns:CheckErrSubmissionRequest" name="parameters"/>
	</wsdl:message>
	<wsdl:message name="CheckErrSubmissionResponse">
		<wsdl:part element="tns:CheckErrSubmissionResponse" name="parameters"/>
	</wsdl:message>
	<wsdl:message name="CheckErrRunRequest">
		<wsdl:part element="tns:CheckErrRunRequest" name="parameters"/>
	</wsdl:message>
	<wsdl:message name="CheckErrRunResponse">
		<wsdl:part element="tns:CheckErrRunResponse" name="parameters"/>
	</wsdl:message>
	
	<wsdl:portType name="EnhancedReportingPortType">
		<wsdl:operation name="EnhancedReportingSubmissionOperation">
			<wsdl:input message="tns:EnhancedReportingSubmissionRequest"/>
			<wsdl:output message="tns:EnhancedReportingSubmissionResponse"/>
		</wsdl:operation>
		<wsdl:operation name="CheckErrSubmissionOperation">
			<wsdl:input message="tns:CheckErrSubmissionRequest"/>
			<wsdl:output message="tns:CheckErrSubmissionResponse"/>
		</wsdl:operation>
		<wsdl:operation name="CheckErrRunOperation">
			<wsdl:input message="tns:CheckErrRunRequest"/>
			<wsdl:output message="tns:CheckErrRunResponse"/>
		</wsdl:operation>
	</wsdl:portType>
	
	<wsdl:binding name="EnhancedReportingBindingSOAP" type="tns:EnhancedReportingPortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="EnhancedReportingSubmissionOperation">
			<soap:operation soapAction="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/EnhancedReportingSubmissionOperation" soapActionRequired="true"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="CheckErrSubmissionOperation">
			<soap:operation soapAction="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/CheckErrSubmissionOperation" soapActionRequired="true"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
		<wsdl:operation name="CheckErrRunOperation">
			<soap:operation soapAction="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/CheckErrRunOperation" soapActionRequired="true"/>
			<wsdl:input>
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	
	<wsdl:service name="EnhancedReportingOnlineService">
		<wsdl:port name="EnhancedReportingBindingSOAP" binding="tns:EnhancedReportingBindingSOAP">
			<soap:address location="https://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting"/>
		</wsdl:port>
	</wsdl:service>
	
</wsdl:definitions>
