PIT3/examples/Example 4_Amendment_of_Incorrect_ERR_Submission/XML/4.2_Amendment_Using_Previous_LineItemId.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:enh="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/">
<soap:Header/>
<soap:Body>
<enh:EnhancedReportingSubmissionRequest>
<enh:SubmissionID>Sub01</enh:SubmissionID>
<enh:Header>
<enh:EmployerRegistrationNumber>1234567T</enh:EmployerRegistrationNumber>
<!-- Optional: -->
<!-- enh:AgentTain>?</enh:AgentTain -->
<enh:EnhancedReportingRunReference>Week 1</enh:EnhancedReportingRunReference>
<enh:TaxYear>2024</enh:TaxYear>
<enh:SoftwareUsed>
<enh:Name>SoapUI</enh:Name>
<enh:Version>5.4.0</enh:Version>
</enh:SoftwareUsed>
</enh:Header>
<!-- Zero or more repetitions: -->
<enh:ExpensesBenefits>
<enh:LineItemID>E3-v2</enh:LineItemID>
<enh:PreviousLineItemID>E3-v1</enh:PreviousLineItemID>
<!-- Optional: -->
<enh:EmployeeID>
<enh:EmployeePPSN>1234567X</enh:EmployeePPSN>
<enh:EmploymentID>1</enh:EmploymentID>
</enh:EmployeeID>
<!-- Optional: -->
<enh:EmployerReference>Ref01</enh:EmployerReference>
<enh:Name>
<enh:FirstName>Patrick</enh:FirstName>
<enh:FamilyName>Bloggs</enh:FamilyName>
</enh:Name>
<!-- Optional: -->
<enh:DateOfBirth>1960-01-01</enh:DateOfBirth>
<enh:Category>TRAVEL_AND_SUBSISTENCE</enh:Category>
<enh:SubCategory>TRAVEL_VOUCHED</enh:SubCategory>
<enh:PaymentDate>2024-01-01</enh:PaymentDate>
<enh:Amount>50</enh:Amount>
<!-- Optional: -->
<!-- enh:SubCategory>?</enh:SubCategory -->
</enh:ExpensesBenefits>
<!-- Zero or more repetitions: -->
<!-- enh:LineItemIDToDelete>Line01</enh:LineItemIDToDelete -->
</enh:EnhancedReportingSubmissionRequest>
</soap:Body>
</soap:Envelope>