PIT3/examples/Example 1_Full_ERR_Life_Cycle/XML/1.5_Check_ERR_Submission_Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:enh="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/">
<soap:Header/>
<soap:Body>
<enh:CheckErrSubmissionRequest>
<enh:EmployerRegistrationNumber>9012147FH</enh:EmployerRegistrationNumber>
<!-- Optional: -->
<!-- <enh:AgentTain>1234567T</enh:AgentTain> -->
<enh:TaxYear>2024</enh:TaxYear>
<enh:SoftwareUsed>
<enh:Name>SoapUI</enh:Name>
<enh:Version>5.4.0</enh:Version>
</enh:SoftwareUsed>
<enh:EnhancedReportingRunReference>Run1</enh:EnhancedReportingRunReference>
<enh:SubmissionID>Sub01</enh:SubmissionID>
</enh:CheckErrSubmissionRequest>
</soap:Body>
</soap:Envelope>