PIT4/examples/ERR Scenarios/XML Scenarios/Multiple Employees Single & Multiple Expenses/ERR_Submission_Multiple_Employees_Single_And_Multiple_Expenses_Request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:enh="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/">
   <soap:Header/>
   <soap:Body>
      <enh:EnhancedReportingSubmissionRequest>
         <enh:SubmissionID>Sub01</enh:SubmissionID>
         <enh:Header>
            <enh:EmployerRegistrationNumber>7654321T</enh:EmployerRegistrationNumber>
            <!--Optional:-->
            <!--enh:AgentTain>?</enh:AgentTain-->
            <enh:EnhancedReportingRunReference>Run12</enh:EnhancedReportingRunReference>
            <enh:TaxYear>2024</enh:TaxYear>
            <enh:SoftwareUsed>
               <enh:Name>SoapUI</enh:Name>
               <enh:Version>5.4.0</enh:Version>
            </enh:SoftwareUsed>
         </enh:Header>
         <!--Zero or more repetitions:-->
         <enh:ExpensesBenefits>
            <enh:LineItemID>Line01</enh:LineItemID>
            <!--Optional:-->
            <!--enh:PreviousLineItemID>?</enh:PreviousLineItemID-->
            <!--Optional:-->
            <enh:EmployeeID>
               <enh:EmployeePPSN>1234567X</enh:EmployeePPSN>
               <enh:EmploymentID>26</enh:EmploymentID>
            </enh:EmployeeID>
            <!--Optional:-->
            <enh:EmployerReference>JDEHJ352</enh:EmployerReference>
            <enh:Name>
               <enh:FirstName>Joe</enh:FirstName>
               <enh:FamilyName>Bloggs</enh:FamilyName>
            </enh:Name>
            <!--Optional:-->
            <enh:Address>
               <!--1 to 3 repetitions:-->
               <enh:AddressLine>12 Station Road</enh:AddressLine>
               <!--Optional:-->
               <enh:County>Dublin</enh:County>
               <!--Optional:-->
               <enh:Eircode>D05FY62</enh:Eircode>
               <!--Optional:-->
               <enh:CountryCode>IRL</enh:CountryCode>
            </enh:Address>
            <!--Optional:-->
            <enh:DateOfBirth>1960-01-01</enh:DateOfBirth>
            <enh:Category>TRAVEL_AND_SUBSISTENCE</enh:Category>
            <enh:SubCategory>TRAVEL_VOUCHED</enh:SubCategory>
            <enh:PaymentDate>2024-02-24</enh:PaymentDate>
            <enh:Amount>25</enh:Amount>
         </enh:ExpensesBenefits>
		 <enh:ExpensesBenefits>
            <enh:LineItemID>Line02</enh:LineItemID>
            <!--Optional:-->
            <!--enh:PreviousLineItemID>?</enh:PreviousLineItemID-->
            <!--Optional:-->
            <enh:EmployeeID>
               <enh:EmployeePPSN>1234567X</enh:EmployeePPSN>
               <enh:EmploymentID>26</enh:EmploymentID>
            </enh:EmployeeID>
            <!--Optional:-->
            <enh:EmployerReference>JDEHJ352</enh:EmployerReference>
            <enh:Name>
               <enh:FirstName>Joe</enh:FirstName>
               <enh:FamilyName>Bloggs</enh:FamilyName>
            </enh:Name>
            <!--Optional:-->
            <enh:Address>
               <!--1 to 3 repetitions:-->
               <enh:AddressLine>12 Station Road</enh:AddressLine>
               <!--Optional:-->
               <enh:County>Dublin</enh:County>
               <!--Optional:-->
               <enh:Eircode>D05FY62</enh:Eircode>
               <!--Optional:-->
               <enh:CountryCode>IRL</enh:CountryCode>
            </enh:Address>
            <!--Optional:-->
            <enh:DateOfBirth>1960-01-01</enh:DateOfBirth>
            <enh:Category>TRAVEL_AND_SUBSISTENCE</enh:Category>
            <enh:SubCategory>TRAVEL_UNVOUCHED</enh:SubCategory>
            <enh:PaymentDate>2024-03-14</enh:PaymentDate>
            <enh:Amount>65</enh:Amount>
         </enh:ExpensesBenefits>
		 <enh:ExpensesBenefits>
            <enh:LineItemID>Line03</enh:LineItemID>
            <!--Optional:-->
            <!--enh:PreviousLineItemID>?</enh:PreviousLineItemID-->
            <!--Optional:-->
            <enh:EmployeeID>
               <enh:EmployeePPSN>1234567X</enh:EmployeePPSN>
               <enh:EmploymentID>26</enh:EmploymentID>
            </enh:EmployeeID>
            <!--Optional:-->
            <enh:EmployerReference>JDEHJ352</enh:EmployerReference>
            <enh:Name>
               <enh:FirstName>Joe</enh:FirstName>
               <enh:FamilyName>Bloggs</enh:FamilyName>
            </enh:Name>
            <!--Optional:-->
            <enh:Address>
               <!--1 to 3 repetitions:-->
               <enh:AddressLine>12 Station Road</enh:AddressLine>
               <!--Optional:-->
               <enh:County>Dublin</enh:County>
               <!--Optional:-->
               <enh:Eircode>D05FY62</enh:Eircode>
               <!--Optional:-->
               <enh:CountryCode>IRL</enh:CountryCode>
            </enh:Address>
            <!--Optional:-->
            <enh:DateOfBirth>1960-01-01</enh:DateOfBirth>
            <enh:Category>TRAVEL_AND_SUBSISTENCE</enh:Category>
            <enh:SubCategory>TRAVEL_UNVOUCHED</enh:SubCategory>
            <enh:PaymentDate>2024-04-19</enh:PaymentDate>
            <enh:Amount>50</enh:Amount>
         </enh:ExpensesBenefits>
		  <enh:ExpensesBenefits>
            <enh:LineItemID>Line04</enh:LineItemID>
            <!--Optional:-->
            <!--enh:PreviousLineItemID>?</enh:PreviousLineItemID-->
            <!--Optional:-->
            <enh:EmployeeID>
               <enh:EmployeePPSN>7654321X</enh:EmployeePPSN>
               <enh:EmploymentID>74</enh:EmploymentID>
            </enh:EmployeeID>
            <!--Optional:-->
            <enh:EmployerReference>PLKA1254</enh:EmployerReference>
            <enh:Name>
               <enh:FirstName>Sarah</enh:FirstName>
               <enh:FamilyName>Bloggs</enh:FamilyName>
            </enh:Name>
            <!--Optional:-->
            <enh:Address>
               <!--1 to 3 repetitions:-->
               <enh:AddressLine>1 Station Road</enh:AddressLine>
               <!--Optional:-->
               <enh:County>Dublin</enh:County>
               <!--Optional:-->
               <enh:Eircode>D05FY92</enh:Eircode>
               <!--Optional:-->
               <enh:CountryCode>IRL</enh:CountryCode>
            </enh:Address>
            <!--Optional:-->
            <enh:DateOfBirth>1960-01-01</enh:DateOfBirth>
            <enh:Category>REMOTE_WORKING_DAILY_ALLOWANCE</enh:Category>
            <enh:PaymentDate>2024-07-07</enh:PaymentDate>
			<enh:NumberOfDays>10</enh:NumberOfDays>
            <enh:Amount>45</enh:Amount>
         </enh:ExpensesBenefits>
		 <enh:ExpensesBenefits>
            <enh:LineItemID>Line05</enh:LineItemID>
            <!--Optional:-->
            <!--enh:PreviousLineItemID>?</enh:PreviousLineItemID-->
            <!--Optional:-->
            <enh:EmployeeID>
               <enh:EmployeePPSN>7654322X</enh:EmployeePPSN>
               <enh:EmploymentID>20</enh:EmploymentID>
            </enh:EmployeeID>
            <!--Optional:-->
            <enh:EmployerReference>UEJD283</enh:EmployerReference>
            <enh:Name>
               <enh:FirstName>Shona</enh:FirstName>
               <enh:FamilyName>Bloggs</enh:FamilyName>
            </enh:Name>
            <!--Optional:-->
            <enh:Address>
               <!--1 to 3 repetitions:-->
               <enh:AddressLine>45 Station Road</enh:AddressLine>
               <!--Optional:-->
               <enh:County>Dublin</enh:County>
               <!--Optional:-->
               <enh:Eircode>D05NY62</enh:Eircode>
               <!--Optional:-->
               <enh:CountryCode>IRL</enh:CountryCode>
            </enh:Address>
            <!--Optional:-->
            <enh:DateOfBirth>1960-01-01</enh:DateOfBirth>
            <enh:Category>TRAVEL_AND_SUBSISTENCE</enh:Category>
            <enh:SubCategory>TRAVEL_UNVOUCHED</enh:SubCategory>
            <enh:PaymentDate>2024-05-28</enh:PaymentDate>
            <enh:Amount>50</enh:Amount>
         </enh:ExpensesBenefits>
         <!--Zero or more repetitions:-->
         <!--enh:LineItemIDToDelete>Line01</enh:LineItemIDToDelete-->
      </enh:EnhancedReportingSubmissionRequest>
   </soap:Body>
</soap:Envelope>