PIT4/examples/Example 3_Underpayment_Correction/XML/3.1_ERR_Submission_Underpayment_Example.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:enh="http://www.ros.ie/schemas/paye-employers/err/v1/enhanced_reporting/">
<soap:Header/>
<soap:Body>
<enh:EnhancedReportingSubmissionRequest>
<enh:SubmissionID>Sub01</enh:SubmissionID>
<enh:Header>
<enh:EmployerRegistrationNumber>1234567T</enh:EmployerRegistrationNumber>
<!--  Optional:  -->
<!--  enh:AgentTain>?</enh:AgentTain  -->
<enh:EnhancedReportingRunReference>Run1</enh:EnhancedReportingRunReference>
<enh:TaxYear>2024</enh:TaxYear>
<enh:SoftwareUsed>
<enh:Name>SoapUI</enh:Name>
<enh:Version>5.4.0</enh:Version>
</enh:SoftwareUsed>
</enh:Header>
<!--  Zero or more repetitions:  -->
<enh:ExpensesBenefits>
<enh:LineItemID>Line01_V1</enh:LineItemID>
<!--  Optional:  -->
<!--  enh:PreviousLineItemID>?</enh:PreviousLineItemID  -->
<!--  Optional:  -->
<enh:EmployeeID>
<enh:EmployeePPSN>1234569X</enh:EmployeePPSN>
<enh:EmploymentID>1</enh:EmploymentID>
</enh:EmployeeID>
<!--  Optional:  -->
<enh:EmployerReference>Ref01</enh:EmployerReference>
<enh:Name>
<enh:FirstName>Mary</enh:FirstName>
<enh:FamilyName>Bloggs</enh:FamilyName>
</enh:Name>
<!--  Optional:  -->
<enh:Address>
<!--  1 to 3 repetitions:  -->
<enh:AddressLine>Address Test 1</enh:AddressLine>
<!--  Optional:  -->
<enh:County>Dublin</enh:County>
<!--  Optional:  -->
<enh:Eircode>D02C383</enh:Eircode>
<!--  Optional:  -->
<enh:CountryCode>IRL</enh:CountryCode>
</enh:Address>
<!--  Optional:  -->
<enh:DateOfBirth>1960-01-01</enh:DateOfBirth>
<enh:Category>TRAVEL_AND_SUBSISTENCE</enh:Category>
<enh:SubCategory>TRAVEL_VOUCHED</enh:SubCategory>
<enh:PaymentDate>2024-02-01</enh:PaymentDate>
<enh:Amount>100</enh:Amount>
</enh:ExpensesBenefits>
</enh:EnhancedReportingSubmissionRequest>
</soap:Body>
</soap:Envelope>